boredgames/app/controllers/sessions_controller.rb

  def create
    username = params[:session][:username]
    password = params[:session][:password]
    @user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "dave"]]