app/views/users/show.html.haml

    - if @user.games
      - @user.games.each do |game|
---
SELECT "games".* FROM "games" INNER JOIN "additions" ON "games"."id" = "additions"."game_id" WHERE "additions"."user_id" = $1  [["user_id", 1]]