app/views/games/show.html.haml

SELECT  1 AS one FROM "games" INNER JOIN "additions" ON "games"."id" = "additions"."game_id" WHERE "additions"."user_id" = $1 AND "games"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 2]]
---
  %img{ src: "http:"+@game.image_url }
  - if current_user && !current_user.games.include?(@game)
    .button

SELECT "mechanics".* FROM "mechanics" INNER JOIN "game_mechanics" ON "mechanics"."id" = "game_mechanics"."mechanic_id" WHERE "game_mechanics"."game_id" = $1  [["game_id", 24]]
---
  %ul.mechanics
    - @game.mechanics.each do |mechanic|