app/controllers/additions_controller.rb

  def create
    game = Game.find(params[:game_id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 2]]

  def destroy
    game = Game.find(params[:id])
    addition = current_user.additions.find_by(game_id: game.id)
    addition.destroy
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "additions".* FROM "additions" WHERE "additions"."user_id" = $1 AND "additions"."game_id" = $2 LIMIT 1  [["user_id", 2], ["game_id", 2]]
DELETE FROM "additions" WHERE "additions"."id" = $1  [["id", 1]]