app/controllers/games_controller.rb

  def index
    # @games = Game.all
    @games = Game.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "games".* FROM "games"  ORDER BY "games"."id" ASC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "games"