app/controllers/relationships_controller.rb

  def create
    user = User.find(params[:user_id])
    relationship = current_user.sent_relationships.new(receiver: user)
    if relationship.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "relationships" ("sender_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sender_id", 1], ["receiver_id", 1], ["created_at", "2016-05-05 01:45:55.923879"], ["updated_at", "2016-05-05 01:45:55.923879"]]