app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "wes"]]
---
  def create
    username = session_params[:username]
    password = session_params[:password]
    @user = User.find_by(username: username)