app/controllers/users_controller.rb

  def destroy
    @user = User.find(params[:id])
    puts "yay"
    if @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]